balazsgrill/modembed/res/Devices/dsPIC30/DSPIC30F5013E.PIC
        <edc:SFRDef edc:access="nnnnnnnn---nnnnn" edc:cname="C1RX1DLC" edc:desc="" edc:impl="0xff1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu---uuuuu" edc:name="C1RX1DLC" edc:nzwidth="0x10" edc:por="xxxxxxxx---xxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="DLC" edc:desc="" edc:mask="0xf" edc:name="DLC" edc:nzwidth="0x4"/>
              <edc:SFRFieldDef edc:cname="RXRB0" edc:desc="" edc:mask="0x1" edc:name="RXRB0" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="3"/>
              <edc:SFRFieldDef edc:cname="RXRB1" edc:desc="" edc:mask="0x1" edc:name="RXRB1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXRTR" edc:desc="" edc:mask="0x1" edc:name="RXRTR" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID0" edc:desc="" edc:mask="0x1" edc:name="EID0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID1" edc:desc="" edc:mask="0x1" edc:name="EID1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID2" edc:desc="" edc:mask="0x1" edc:name="EID2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID3" edc:desc="" edc:mask="0x1" edc:name="EID3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID4" edc:desc="" edc:mask="0x1" edc:name="EID4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID5" edc:desc="" edc:mask="0x1" edc:name="EID5" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:AdjustPoint edc:offset="0xA"/>
              <edc:SFRFieldDef edc:cname="EID5_0" edc:desc="" edc:mask="0x1" edc:name="EID5_0" edc:nzwidth="0x6"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="DLC0" edc:desc="" edc:mask="0x1" edc:name="DLC0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DLC1" edc:desc="" edc:mask="0x1" edc:name="DLC1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DLC2" edc:desc="" edc:mask="0x1" edc:name="DLC2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DLC3" edc:desc="" edc:mask="0x1" edc:name="DLC3" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnnnnnnnnnn" edc:cname="C1RX1B1" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuuuuuuuuuu" edc:name="C1RX1B1" edc:nzwidth="0x10" edc:por="xxxxxxxxxxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TXB1D0" edc:desc="" edc:islanghidden="true" edc:mask="0xff" edc:name="TXB1D0" edc:nzwidth="0x8"/>
              <edc:SFRFieldDef edc:cname="TXB1D1" edc:desc="" edc:islanghidden="true" edc:mask="0xff" edc:name="TXB1D1" edc:nzwidth="0x8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="TXB1D00" edc:desc="" edc:mask="0x1" edc:name="TXB1D00" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB1D01" edc:desc="" edc:mask="0x1" edc:name="TXB1D01" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB1D02" edc:desc="" edc:mask="0x1" edc:name="TXB1D02" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB1D03" edc:desc="" edc:mask="0x1" edc:name="TXB1D03" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB1D04" edc:desc="" edc:mask="0x1" edc:name="TXB1D04" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB1D05" edc:desc="" edc:mask="0x1" edc:name="TXB1D05" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB1D06" edc:desc="" edc:mask="0x1" edc:name="TXB1D06" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB1D07" edc:desc="" edc:mask="0x1" edc:name="TXB1D07" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB1D10" edc:desc="" edc:mask="0x1" edc:name="TXB1D10" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB1D11" edc:desc="" edc:mask="0x1" edc:name="TXB1D11" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB1D12" edc:desc="" edc:mask="0x1" edc:name="TXB1D12" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB1D13" edc:desc="" edc:mask="0x1" edc:name="TXB1D13" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB1D14" edc:desc="" edc:mask="0x1" edc:name="TXB1D14" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB1D15" edc:desc="" edc:mask="0x1" edc:name="TXB1D15" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB1D16" edc:desc="" edc:mask="0x1" edc:name="TXB1D16" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB1D17" edc:desc="" edc:mask="0x1" edc:name="TXB1D17" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="r" edc:stimregfiles="r" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnnnnnnnnnn" edc:cname="C1RX1B2" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuuuuuuuuuu" edc:name="C1RX1B2" edc:nzwidth="0x10" edc:por="xxxxxxxxxxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TXB1D2" edc:desc="" edc:islanghidden="true" edc:mask="0xff" edc:name="TXB1D2" edc:nzwidth="0x8"/>
              <edc:SFRFieldDef edc:cname="TXB1D3" edc:desc="" edc:islanghidden="true" edc:mask="0xff" edc:name="TXB1D3" edc:nzwidth="0x8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="TXB1D20" edc:desc="" edc:mask="0x1" edc:name="TXB1D20" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB1D21" edc:desc="" edc:mask="0x1" edc:name="TXB1D21" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB1D22" edc:desc="" edc:mask="0x1" edc:name="TXB1D22" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB1D23" edc:desc="" edc:mask="0x1" edc:name="TXB1D23" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB1D24" edc:desc="" edc:mask="0x1" edc:name="TXB1D24" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB1D25" edc:desc="" edc:mask="0x1" edc:name="TXB1D25" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB1D26" edc:desc="" edc:mask="0x1" edc:name="TXB1D26" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB1D27" edc:desc="" edc:mask="0x1" edc:name="TXB1D27" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB1D30" edc:desc="" edc:mask="0x1" edc:name="TXB1D30" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB1D31" edc:desc="" edc:mask="0x1" edc:name="TXB1D31" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB1D32" edc:desc="" edc:mask="0x1" edc:name="TXB1D32" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB1D33" edc:desc="" edc:mask="0x1" edc:name="TXB1D33" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB1D34" edc:desc="" edc:mask="0x1" edc:name="TXB1D34" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB1D35" edc:desc="" edc:mask="0x1" edc:name="TXB1D35" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB1D36" edc:desc="" edc:mask="0x1" edc:name="TXB1D36" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB1D37" edc:desc="" edc:mask="0x1" edc:name="TXB1D37" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="r" edc:stimregfiles="r" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnnnnnnnnnn" edc:cname="C1RX1B3" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuuuuuuuuuu" edc:name="C1RX1B3" edc:nzwidth="0x10" edc:por="xxxxxxxxxxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TXB1D4" edc:desc="" edc:islanghidden="true" edc:mask="0xff" edc:name="TXB1D4" edc:nzwidth="0x8"/>
              <edc:SFRFieldDef edc:cname="TXB1D5" edc:desc="" edc:islanghidden="true" edc:mask="0xff" edc:name="TXB1D5" edc:nzwidth="0x8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="TXB1D40" edc:desc="" edc:mask="0x1" edc:name="TXB1D40" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB1D41" edc:desc="" edc:mask="0x1" edc:name="TXB1D41" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB1D42" edc:desc="" edc:mask="0x1" edc:name="TXB1D42" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB1D43" edc:desc="" edc:mask="0x1" edc:name="TXB1D43" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB1D44" edc:desc="" edc:mask="0x1" edc:name="TXB1D44" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB1D45" edc:desc="" edc:mask="0x1" edc:name="TXB1D45" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB1D46" edc:desc="" edc:mask="0x1" edc:name="TXB1D46" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB1D47" edc:desc="" edc:mask="0x1" edc:name="TXB1D47" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB1D50" edc:desc="" edc:mask="0x1" edc:name="TXB1D50" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB1D51" edc:desc="" edc:mask="0x1" edc:name="TXB1D51" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB1D52" edc:desc="" edc:mask="0x1" edc:name="TXB1D52" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB1D53" edc:desc="" edc:mask="0x1" edc:name="TXB1D53" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB1D54" edc:desc="" edc:mask="0x1" edc:name="TXB1D54" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB1D55" edc:desc="" edc:mask="0x1" edc:name="TXB1D55" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB1D56" edc:desc="" edc:mask="0x1" edc:name="TXB1D56" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB1D57" edc:desc="" edc:mask="0x1" edc:name="TXB1D57" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="r" edc:stimregfiles="r" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
